cases/openfoam/fluids/naca4412_trailing_edge_separation/solution/case/0/U
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions [0 1 -1 0 0 0 0];

// alpha = 13.87 deg
//   Ux = 30 * cos(13.87 deg) = 29.1257
//   Uy = 30 * sin(13.87 deg) =  7.1882
internalField uniform (29.1257 7.1882 0);

boundaryField
{
    inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (29.1257 7.1882 0);
        value           uniform (29.1257 7.1882 0);
    }
    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (29.1257 7.1882 0);
        value           uniform (29.1257 7.1882 0);
    }
    top
    {
        type            freestreamVelocity;
        freestreamValue uniform (29.1257 7.1882 0);
        value           uniform (29.1257 7.1882 0);
    }
    bottom
    {
        type            freestreamVelocity;
        freestreamValue uniform (29.1257 7.1882 0);
        value           uniform (29.1257 7.1882 0);
    }
    airfoil
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            slip;
    }
}
