cases/openfoam/fluids/naca4412_trailing_edge_separation/solution/case/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}

dimensions [0 2 -1 0 0 0 0];

// Free-stream nuTilda = 3 * nu_inf for tripped/turbulent BL (SA convention)
internalField uniform 7.5e-5;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 7.5e-5;
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform 7.5e-5;
    }
    top
    {
        type            freestream;
        freestreamValue uniform 7.5e-5;
    }
    bottom
    {
        type            freestream;
        freestreamValue uniform 7.5e-5;
    }
    airfoil
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBack
    {
        type            slip;
    }
}
