cases/openfoam/fluids/naca4412_trailing_edge_separation/solution/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// NACA 4412 Coles-Wadcock conditions: Re_c = 1.52e6
// With c=1, U=30: nu = U*c/Re = 30/1.52e6 = 1.974e-5

transportModel  Newtonian;
nu              1.974e-05;
