cases/openfoam/fluids/naca4412_trailing_edge_separation/solution/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         2000;

deltaT          1;

writeControl    timeStep;
writeInterval   1000;

purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// alpha = 13.87 deg
//   liftDir = (-sin(13.87), cos(13.87), 0) = (-0.23961, 0.97086, 0)
//   dragDir = ( cos(13.87), sin(13.87), 0) = ( 0.97086, 0.23961, 0)

functions
{
    forces1
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   100;

        patches         (airfoil);
        rho             rhoInf;
        rhoInf          1.225;
        CofR            (0.25 0 0);
        liftDir         (-0.23961 0.97086 0);
        dragDir         ( 0.97086 0.23961 0);
        pitchAxis       (0 0 1);
        magUInf         30.0;
        lRef            1.0;
        Aref            0.5;       // chord * span (0.5 m thick slab)
    }

    // Wall shear stress field for separation detection
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeFields     true;
        patches         (airfoil);
    }

    // Sample wall pressure and wallShearStress on the airfoil surface
    surfaceSamples
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        interpolationScheme cellPoint;
        surfaceFormat   raw;
        fields          (p wallShearStress);
        surfaces
        {
            airfoilSurface
            {
                type    patch;
                patches (airfoil);
                interpolate false;
            }
        }
    }
}
